package quiz;

public class E02_oneCard {
/*
    	원카드
  
   1. 시작하는 패는 5장으로 최대 5명
   2. ♠ ♣ ♡  ◇  colorjoker, joker
   3. 덱이 다떨어지면 낸카드들을 셔플(원본 덱 배열1 카드를 낸곳을 저장하는 배열2 원본덱이 없으면 덱1에 덱2를 추가)
   4. 오직 같은 숫자나 같은 색으로만 낼수있게 조건걸기
   5. 7을 내면 원하는 문양으로 바꿀수 있게 설정
   6. j를 내면 차례 한번 건너뛰기
   7. q는 역순으로 바꾸기
   9. k는 본인차례 한번더
   10. 2로 공격하면 2장 1로 공격하면 3장 스페이드 a는 4장 조커 5장 칼라조커 8장
   11. 본인의 패가 13장이상이면 패배 >>>>> 들고잇던 카드 덱에 셔플
   12. 스페이드 a는 흑조커로만(반대의 경우도) 수비가능 흑조커는 칼라조커로만 수비가능
   13. 칼라조커는 오직 흑조커로만 수비가능
   14. 조커카드들은 같은 색일경우 항상 낼수있음
   15. 원카드를 외치는 기능은 삭제
   16. 본인의 패에 같은 숫자가의 다른모양이 있으면 한턴에 한번에 같이 낼수있음(본인이 선택할 수 있어야함)	   
   17.   
   
    
*/
}
